# Core shell and platform tools
brew "awscli"
brew "bash"
brew "git"
brew "git-delta"
brew "jq"

# Navigation and terminal workflow
brew "fd"
brew "fzf"
brew "lazygit"
brew "ripgrep"
brew "tmux"
brew "tmuxp"

# Editor and runtime foundation
brew "neovim"
brew "node"
brew "tree-sitter-cli"
brew "uv"

# Language and formatting tools
brew "go"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "terraform"
brew "tflint"
brew "yq"

# Containers
brew "colima"
brew "docker"

# Terminal UI
cask "font-jetbrains-mono-nerd-font"
cask "kitty"
